Config/Documents/ПереносОстатков64нНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПереносОстатков64нНФА</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.УчетныеДанныеОбъектаОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииПереносОстатков64нНФА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборКФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Переводы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСтарый</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНовый</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ДатыПереходаНаПрименениеРедакцийПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыПереходаНаПрименениеРедакцийПС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПрименения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РедакцияПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РедакцииПланаСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Enums/РедакцииПланаСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РедакцииПланаСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приказ64н2018</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приказ298н2019</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ОперацииПереносОстатков64нНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОперацииПереносОстатков64нНФА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеАктивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмуществоВКонцессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмуществоВКонцессииИК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредметыЛизинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредметыЛизингаМЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяНедвижимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сооружения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиблиотечныйФонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиологическиеРесурсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключенныеСчетаИмущество</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ТипыНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНФА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЖилыеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НежилыеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сооружения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Биоресурсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиблиотечныйФонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяНедвижимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НепроизведенныеАктивы</Name>
					<Comment>Для вида НФА ПраваПользованияИмуществом</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПереносОстатков64нНФА/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда
		ДатаПС = ПолучитьДатуДокументаСервер(Объект.Организация);
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОтразитьВидимостьДатыПС();
	
	ОтразитьПараметрыОперацииНаФорме();

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ДатыПереходаНаПрименениеРедакцийПСЗапись" Тогда
		Если Параметр.Организация = Объект.Организация И Параметр.РедакцияПС =
			ПредопределенноеЗначение("Перечисление.РедакцииПланаСчетов.Приказ64н2018") Тогда
			ДатаПС = Параметр.ДатаНачалаПрименения;
			ОтразитьВидимостьДатыПС();
		КонецЕсли;
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДатаПС = ПолучитьДатуДокументаСервер(Объект.Организация);
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.Переводы.Очистить();
	
	ОтразитьПараметрыОперацииНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборСчета(Элемент, Объект.ОтборСчет, ПолучитьПараметрыОперации().Счета, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОтразитьВидимостьДатыПС();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Переводы

&НаКлиенте
Процедура ПереводыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТипЗнач = ТипЗнч(ВыбранноеЗначение);
	
	Если ТипЗнач = Тип("СправочникСсылка.ОсновныеСредства")
		Или ТипЗнач = Тип("СправочникСсылка.Номенклатура") Тогда
		
		СписокОбъектов = Новый Массив;
		СписокОбъектов.Добавить(ВыбранноеЗначение);
		
		ЗаполнитьСтрокуТЧ(СписокОбъектов);
		
	ИначеЕсли ТипЗнач = Тип("Массив") Тогда
		
		ЗаполнитьСтрокуТЧ(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнач = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
		
		Для Каждого ТекСтрока Из Элементы.Переводы.ВыделенныеСтроки Цикл
			Объект.Переводы.НайтиПоИдентификатору(ТекСтрока).СчетНовый = ВыбранноеЗначение;
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводыСчетНовыйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.Переводы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.СчетСтарый) Тогда
		СписокНовыхСчетов = ПолучитьНовыйСчетКлиент(ТекСтрока);
	Иначе
		СписокНовыхСчетов = ВсеНовыеСчетаОперации();
	КонецЕсли;
	
	ВыборСчета(Элемент, ТекСтрока.СчетНовый, СписокНовыхСчетов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	ИнициализироватьПараметрыОпераций();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПСЗадатьНажатие(Элемент)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация"	, Объект.Организация);
	ЗначенияЗаполнения.Вставить("РедакцияПС"	, ПредопределенноеЗначение("Перечисление.РедакцииПланаСчетов.Приказ64н2018"));
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("РегистрСведений.ДатыПереходаНаПрименениеРедакцийПС.ФормаЗаписи", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПодбор(Команда)

	ПараметрыОперации = ПолучитьПараметрыОперации();
	
	Если ПараметрыОперации.ТипОбъекта = "ОсновныеСредства" Тогда
		
		Отбор = Новый Структура("Организация", Объект.Организация);
		Если ЗначениеЗаполнено(ПараметрыОперации.ТипНФА) Тогда
			Отбор.Вставить("ТипНФА", ПараметрыОперации.ТипНФА);
		КонецЕсли;
		Если ПараметрыОперации.ИК <> Null Тогда
			Отбор.Вставить("ИмуществоКазны", ПараметрыОперации.ИК);
		КонецЕсли;		
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Отбор);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
		ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
		ОткрытьФорму("Справочник.ОсновныеСредства.ФормаВыбора", ПараметрыФормы, Элементы.Переводы);
		
	ИначеЕсли ПараметрыОперации.ТипОбъекта = "Номенклатура" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Переводы); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗаполнить(Команда)
	
	Если Не ЗначениеЗаполнено(ДатаПС) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задана дата начала применения плана счетов по приказу 64н");
		Возврат;
	КонецЕсли;
	
	Если Объект.Переводы.Количество() > 0 Тогда		
		ТекстВопроса = "Таблица переноса будет очищена. Продолжить?";
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбъектыЗаполнитьПослеЗакрытияВопроса", ЭтаФорма, Параметры);		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);		
	Иначе
		ЗаполнитьТаблицуПереносаСервер();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыЗаполнитьПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуПереносаСервер();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьСтарыйСчет(Команда)
	
	ПерезаполнитьСтарыйСчетСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНовыйСчет(Команда)
	
	НовыеСчетаОперации = ВсеНовыеСчетаОперации();
	
	ВыборСчета(Элементы.Переводы,, НовыеСчетаОперации);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ДатаПС = ПолучитьДатуДокументаСервер(Объект.Организация);
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	ИнициализироватьПараметрыОпераций();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуДокументаСервер(Организация)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат '00010101';
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("РедакцияПС", Перечисления.РедакцииПланаСчетов.Приказ64н2018);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатыПереходаНаПрименениеРедакцийПС.ДатаНачалаПрименения КАК ДатаНачалаПрименения
	|ИЗ
	|	РегистрСведений.ДатыПереходаНаПрименениеРедакцийПС КАК ДатыПереходаНаПрименениеРедакцийПС
	|ГДЕ
	|	ДатыПереходаНаПрименениеРедакцийПС.Организация = &Организация
	|	И ДатыПереходаНаПрименениеРедакцийПС.РедакцияПС = &РедакцияПС";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ДатаНачалаПрименения;
	Иначе
		Результат = '00010101';
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ИнициализироватьПараметрыОпераций();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьПараметрыОпераций()

	ПравилаПереноса = Новый ТаблицаЗначений;
	ПравилаПереноса.Колонки.Добавить("Операция"		, Новый ОписаниеТипов("Строка"));
	ПравилаПереноса.Колонки.Добавить("СчетСтарый"	, Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПравилаПереноса.Колонки.Добавить("СчетНовый"	, Новый ОписаниеТипов("СписокЗначений"));
	ПравилаПереноса.Колонки.Добавить("ДопУсловие"	, Новый ОписаниеТипов("Строка"));
	ПравилаПереноса.Колонки.Добавить("Описание"		, Новый ОписаниеТипов("Строка"));
	
	ИсключитьОЦИ = ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ЭтоКазенноеУчреждение;
	
	Макет = Документы.ПереносОстатков64нНФА.ПолучитьМакет("Настройки");
	Для Сч = 2 По Макет.ВысотаТаблицы Цикл			
		Операция = СокрЛП(Макет.Область("R"+Сч+"C1").Текст);
		Если Не ПустаяСтрока(Операция) Тогда				
			СписокСчетов = СписокСчетовПоКодуИДате(Макет.Область("R"+Сч+"C2").Текст);
			Если СписокСчетов.Количество() > 0 Тогда
				СчетСтарый = СписокСчетов[0];
				Если ЗначениеЗаполнено(СчетСтарый) Тогда
					КодыСчетов = СокрЛП(Макет.Область("R"+Сч+"C3").Текст);
					СчетНовый = Новый СписокЗначений;
					Если Не ПустаяСтрока(КодыСчетов) Тогда
						СчетНовый.ЗагрузитьЗначения(СписокСчетовПоКодуИДате(КодыСчетов, ИсключитьОЦИ));
					КонецЕсли;
					НоваяСтрока				= ПравилаПереноса.Добавить();
					НоваяСтрока.Операция	= Операция;
					НоваяСтрока.СчетСтарый	= СчетСтарый;
					НоваяСтрока.СчетНовый	= СчетНовый;
					НоваяСтрока.ДопУсловие	= СокрЛП(Макет.Область("R"+Сч+"C4").Текст);
					НоваяСтрока.Описание	= СокрЛП(Макет.Область("R"+Сч+"C5").Текст);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОпераций.Очистить();
	
	Для Каждого Операция Из Перечисления.ОперацииПереносОстатков64нНФА Цикл
		
		ИмяОперации = ЗначениеРеквизитаПеречисления(Операция, "Имя");		
		СтрокиПравил = ПравилаПереноса.НайтиСтроки(Новый Структура("Операция", ИмяОперации));
		ПравилаОперации = ПравилаПереноса.Скопировать(СтрокиПравил, "СчетСтарый,СчетНовый,ДопУсловие");
		
		СчетаОперации = ПравилаОперации.ВыгрузитьКолонку("СчетСтарый");
				
		ПараметрыОперации = ПараметрыОпераций.Добавить();
		ПараметрыОперации.Операция = Операция;
		ПараметрыОперации.Правила.Загрузить(ПравилаОперации);
		ПараметрыОперации.Счета.ЗагрузитьЗначения(СчетаОперации);		
		Если СтрокиПравил.Количество() > 0 Тогда
			ПараметрыОперации.Описание = СтрокиПравил[0].Описание;
		КонецЕсли;
		
		ДополнитьПараметрыОперации(ПараметрыОперации); 
		
	КонецЦикла;
	
	ПараметрыОперации = ПараметрыОпераций.Добавить();
	ПараметрыОперации.Операция = Перечисления.ОперацииПереносОстатков64нНФА.ПустаяСсылка();
	ДополнитьПараметрыОперации(ПараметрыОперации);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокСчетовПоКодуИДате(СтрокаКодов, ИсключитьОЦИ = Ложь)
	
	МассивКодов = СтрРазделить(СтрокаКодов, ",", Ложь);
	ТаблицаКодов = Новый ТаблицаЗначений;
	ТаблицаКодов.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(6)));
	ТаблицаКодов.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Для Каждого ТекКод Из МассивКодов Цикл
		пТекКод = СокрЛП(ТекКод);
		НоваяСтрока = ТаблицаКодов.Добавить();
		ПозицияТочек = Найти(пТекКод, ":");
		Если ПозицияТочек = 0 Тогда
			НоваяСтрока.Код        = пТекКод;
			НоваяСтрока.ДатаНачала = Дата(1,1,1);
		Иначе	
			НоваяСтрока.Код        = Лев(пТекКод, (ПозицияТочек - 1));
			НоваяСтрока.ДатаНачала = Дата(Сред(пТекКод, (ПозицияТочек + 1)));
		КонецЕсли;	
	КонецЦикла;	
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКодов.Код КАК Код,
	|	НАЧАЛОПЕРИОДА(ТаблицаКодов.ДатаНачала, ДЕНЬ) КАК ДатаНачала
	|ПОМЕСТИТЬ ТабКодов
	|ИЗ
	|	&ТаблицаКодов КАК ТаблицаКодов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабКодов КАК ТабКодов
	|		ПО ЕПСБУ.Код = ТабКодов.Код
	|			И ЕПСБУ.ДатаНачалаДействия = ТабКодов.ДатаНачала";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаКодов", ТаблицаКодов);
	
	Если ИсключитьОЦИ Тогда
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	НЕ ЕПСБУ.Ссылка В (&СчетаОЦИ)";
		Запрос.УстановитьПараметр("СчетаОЦИ", БухгалтерскийУчетКлиентСервер.СписокСчетов("101.20,102.20,104.20,105.20,106.20,107.20"));
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаПеречисления(Значение, Реквизит)
	
	Мет			= Значение.Метаданные();
	Индекс		= Перечисления[Мет.Имя].Индекс(Значение);
	Результат	= Мет.ЗначенияПеречисления[Индекс][Реквизит];
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДополнитьПараметрыОперации(ПараметрыОперации)
	
	ПараметрыОперации.ТипОбъекта	= "ОсновныеСредства";
	ПараметрыОперации.ТипНФА		= Перечисления.ТипыНФА.ПустаяСсылка();
	ПараметрыОперации.ИК			= Null;
	ПараметрыОперации.Заголовок		= "Основное средство";
	
	Если ПараметрыОперации.Операция = Перечисления.ОперацииПереносОстатков64нНФА.ИмуществоВКонцессии Тогда
		ПараметрыОперации.ИК = Ложь;	
	ИначеЕсли ПараметрыОперации.Операция = Перечисления.ОперацииПереносОстатков64нНФА.ИмуществоВКонцессииИК Тогда
		ПараметрыОперации.ИК = Истина;	
	ИначеЕсли ПараметрыОперации.Операция = Перечисления.ОперацииПереносОстатков64нНФА.ПредметыЛизингаМЗ Тогда
		ПараметрыОперации.ТипОбъекта = "Номенклатура";	
	ИначеЕсли ПараметрыОперации.Операция = Перечисления.ОперацииПереносОстатков64нНФА.ИнвестиционнаяНедвижимость Тогда
		ПараметрыОперации.ТипНФА = Перечисления.ТипыНФА.ИнвестиционнаяНедвижимость;
	ИначеЕсли ПараметрыОперации.Операция = Перечисления.ОперацииПереносОстатков64нНФА.Сооружения Тогда
		ПараметрыОперации.ТипНФА = Перечисления.ТипыНФА.Сооружения;
	ИначеЕсли ПараметрыОперации.Операция = Перечисления.ОперацииПереносОстатков64нНФА.БиблиотечныйФонд Тогда
		ПараметрыОперации.ТипНФА = Перечисления.ТипыНФА.БиблиотечныйФонд;
	ИначеЕсли ПараметрыОперации.Операция = Перечисления.ОперацииПереносОстатков64нНФА.БиологическиеРесурсы Тогда	
		ПараметрыОперации.ТипНФА = Перечисления.ТипыНФА.Биоресурсы;
	КонецЕсли;
	
	Если ПараметрыОперации.ТипОбъекта = "Номенклатура" Тогда		
		ПараметрыОперации.Заголовок = "Номенклатура";
	ИначеЕсли ЗначениеЗаполнено(ПараметрыОперации.ТипНФА) Тогда
		ПараметрыОперации.Заголовок = ЗначениеРеквизитаПеречисления(ПараметрыОперации.ТипНФА, "Синоним");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыОперации()
	
	Возврат ПараметрыОпераций.НайтиСтроки(Новый Структура("Операция", Объект.ВидОперации))[0];
	
КонецФункции

&НаКлиенте
Процедура ОтразитьВидимостьДатыПС()
	
	Элементы.ДатаПС.Видимость = ЗначениеЗаполнено(ДатаПС);
	Элементы.ДатаПСЗадать.Видимость = Не ЗначениеЗаполнено(ДатаПС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьПараметрыОперацииНаФорме()
	
	ПараметрыОперации = ПолучитьПараметрыОперации();
	Элементы.Контрагент.Видимость = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатков64нНФА.НеАктивы"));
	Элементы.ПереводыОбъект.Заголовок = ПараметрыОперации.Заголовок;
	Элементы.ВидОперации.РасширеннаяПодсказка.Заголовок = ?(ЗначениеЗаполнено(ПараметрыОперации.Описание),
		"Варианты переноса:" + Символы.ПС + Символы.ПС + ПараметрыОперации.Описание, "");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПереносаСервер()
	
	Результат = ПолучитьТаблицуОстатков();
	Объект.Переводы.Загрузить(Результат);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуОстатков(СпОбъектов = Неопределено)
	
	ПараметрыОперации = ПараметрыОпераций.НайтиСтроки(Новый Структура("Операция", Объект.ВидОперации))[0];
	
	Если ПараметрыОперации.ТипОбъекта = "Номенклатура" Тогда
		Субконто = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;	
	Иначе
		Субконто = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства;	
	КонецЕсли;
	
	ДатаПерехода = НачалоДня(ДатаПС) - 1;	
	ПериодКонец	 = Новый Граница(ДатаПерехода, ВидГраницы.Включая);
	ПериодНачало = ?(КонецДня(ДатаПерехода) = КонецГода(ДатаПерехода), ПериодКонец, Новый Граница(НачалоГода(ДатаПерехода), ВидГраницы.Исключая));	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"		, Объект.Ссылка);
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец"	, ПериодКонец);
	Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
	Запрос.УстановитьПараметр("Счет"		, ПараметрыОперации.Счета);
	Запрос.УстановитьПараметр("Субконто"	, Субконто);
	
	Если СпОбъектов = Неопределено И
		(ЗначениеЗаполнено(Объект.ОтборИФО) Или ЗначениеЗаполнено(Объект.ОтборПодразделение)
		Или ЗначениеЗаполнено(Объект.ОтборСчет) Или ЗначениеЗаполнено(Объект.ОтборКФО)) Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Остатки.Субконто1 КАК Объект
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОстаткиИОбороты(
		|			&ПериодНачало,
		|			&ПериодКонец,
		|			,
		|			,
		|			Счет В (&Счет),
		|			&Субконто,
		|			Организация = &Организация
		|				И ИФО = &ИФО
		|				И КФО = &КФО) КАК Остатки
		|ГДЕ
		|	Остатки.Подразделение = &Подразделение";
		
		Если ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
			Запрос.УстановитьПараметр("ИФО", Объект.ОтборИФО);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИФО = &ИФО", "");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
			Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Остатки.Подразделение = &Подразделение", "ИСТИНА");
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Объект.ОтборСчет) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Счет", "&пСчет");
			Запрос.УстановитьПараметр("пСчет", Объект.ОтборСчет);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
			Запрос.УстановитьПараметр("КФО", Объект.ОтборКФО);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КФО = &КФО", "");
		КонецЕсли;
		
		СпОбъектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Объект");
		
	КонецЕсли;
		
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Остатки.Счет КАК СчетСтарый,
	|	Остатки.Субконто1 КАК Объект
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОстаткиИОбороты(
	|			&ПериодНачало,
	|			&ПериодКонец,
	|			,
	|			,
	|			Счет В (&Счет),
	|			&Субконто,
	|			Организация = &Организация
	|				И Субконто1 В (&СпОбъектов)
	|				И НЕ Субконто1 В
	|						(ВЫБРАТЬ
	|							Переводы.Объект
	|						ИЗ
	|							Документ.ПереносОстатков64нНФА.Переводы КАК Переводы
	|						ГДЕ
	|							Переводы.Ссылка.Проведен
	|							И Переводы.Ссылка <> &Ссылка)) КАК Остатки
	|ГДЕ
	|	&Условие
	|
	|УПОРЯДОЧИТЬ ПО
	|	Объект,
	|	Остатки.Счет.Порядок";
	
	Если СпОбъектов = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Субконто1 В (&СпОбъектов)", "");				
	Иначе
		Запрос.УстановитьПараметр("СпОбъектов", СпОбъектов); 
	КонецЕсли;
	
	Условие = "ИСТИНА";
	
	Если Объект.ВидОперации = Перечисления.ОперацииПереносОстатков64нНФА.ИмуществоВКонцессии Тогда
	    Условие = "ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.ОсновныеСредства).ИмуществоКазны = ЛОЖЬ";
	ИначеЕсли Объект.ВидОперации = Перечисления.ОперацииПереносОстатков64нНФА.ИмуществоВКонцессииИК Тогда
	    Условие = "ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.ОсновныеСредства).ИмуществоКазны = ИСТИНА";	
	ИначеЕсли Объект.ВидОперации = Перечисления.ОперацииПереносОстатков64нНФА.ИнвестиционнаяНедвижимость Тогда
		Условие = "ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.ОсновныеСредства).ТипНФА = ЗНАЧЕНИЕ(Перечисление.ТипыНФА.ИнвестиционнаяНедвижимость)";
	ИначеЕсли Объект.ВидОперации = Перечисления.ОперацииПереносОстатков64нНФА.БиологическиеРесурсы Тогда
		Условие = "ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.ОсновныеСредства).ТипНФА = ЗНАЧЕНИЕ(Перечисление.ТипыНФА.Биоресурсы)";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", Условие);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("СчетНовый");
	
	Для Каждого ТекСтрока Из Результат Цикл
		СписокНовыхСчетов = ПолучитьНовыйСчет(ПараметрыОперации.Правила, ТекСтрока);
		Если СписокНовыхСчетов.Количество() = 1 Тогда
			ТекСтрока.СчетНовый = СписокНовыхСчетов[0];
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьНовыйСчет(Правила, ТекСтрока)
	
	Для Каждого СтрокаОперации Из Правила Цикл
		Если СтрокаОперации.СчетСтарый = ТекСтрока.СчетСтарый Тогда
			Если СтрокаОперации.ДопУсловие = "био" И Не ЭтоБиоресурс(ТекСтрока.Объект) Тогда
				Продолжить;				
			КонецЕсли;
			Возврат СтрокаОперации.СчетНовый.ВыгрузитьЗначения();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Массив;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНовыйСчетКлиент(ТекСтрока)
	
	Правила = ПолучитьПараметрыОперации().Правила;
	
	Для Каждого СтрокаОперации Из Правила Цикл
		Если СтрокаОперации.СчетСтарый = ТекСтрока.СчетСтарый Тогда
			Если СтрокаОперации.ДопУсловие = "био" И Не ЭтоБиоресурс(ТекСтрока.Объект) Тогда
				Продолжить;				
			КонецЕсли;
			Возврат СтрокаОперации.СчетНовый.ВыгрузитьЗначения();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Массив;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоБиоресурс(ОС)
	
	Возврат (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОС, "ТипНФА") = Перечисления.ТипыНФА.Биоресурсы);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуТЧ(ОбъектНФА)
	
	Если ЗначениеЗаполнено(ОбъектНФА) Тогда
		Данные = ПолучитьТаблицуОстатков(ОбъектНФА);
	Иначе
		Данные = Новый ТаблицаЗначений;
	КонецЕсли;
	
	Если Данные.Количество() > 0 Тогда	
		Для Сч = 1 По Данные.Количество() Цикл
			НоваяСтрока				= Объект.Переводы.Добавить();
			НоваяСтрока.Объект		= Данные[Сч-1].Объект;
			НоваяСтрока.СчетСтарый	= Данные[Сч-1].СчетСтарый;
			НоваяСтрока.СчетНовый	= Данные[Сч-1].СчетНовый;			
		КонецЦикла;
	Иначе
		Для Каждого Об Из ОбъектНФА Цикл
			НоваяСтрока				= Объект.Переводы.Добавить();
			НоваяСтрока.Объект		= Об;		
			НоваяСтрока.СчетСтарый	= ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			НоваяСтрока.СчетНовый	= ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВсеНовыеСчетаОперации()
	
	Результат = Новый Массив;
	
	ПараметрыОперации = ПолучитьПараметрыОперации();
	
	Для Каждого СтрокаОперации Из ПараметрыОперации.Правила Цикл
		Для Каждого СчетОперации Из СтрокаОперации.СчетНовый Цикл
			Если Результат.Найти(СчетОперации.Значение) = Неопределено Тогда
				Результат.Добавить(СчетОперации.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыборСчета(Владелец, ТекущиееЗначение, СписокСчетов, НовыйСчет = Истина)
	
	ДатаПерехода = НачалоДня(ДатаПС) - 1;
	Если КонецДня(ДатаПерехода) = КонецГода(ДатаПерехода) Тогда		
		ДатаДляОтбора = ?(НовыйСчет, КонецДня(ДатаПерехода) + 1, ДатаПерехода); 
	Иначе
		ДатаДляОтбора = ?(НовыйСчет, ДатаПерехода, НачалоГода(ДатаПерехода) - 1);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НаДату", ДатаДляОтбора);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", СписокСчетов));	
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, Владелец);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьСтарыйСчетСервер()
	
	СпОбъектов = Объект.Переводы.Выгрузить().ВыгрузитьКолонку("Объект");
	Результат = ПолучитьТаблицуОстатков(СпОбъектов);
	
	ПустойСчет = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	
	Правила = ПараметрыОпераций.НайтиСтроки(Новый Структура("Операция", Объект.ВидОперации))[0].Правила;
	
	Для Каждого ТекСтрока Из Объект.Переводы Цикл
		
		СтрРезультат = Результат.Найти(ТекСтрока.Объект, "Объект");
		
		Если СтрРезультат = Неопределено Тогда
			ТекСтрока.СчетСтарый = ПустойСчет;
			//ТекСтрока.СчетНовый = ПустойСчет;
		Иначе
			ТекСтрока.СчетСтарый = СтрРезультат.СчетСтарый;
			Если СтрРезультат.СчетНовый <> ПустойСчет Тогда
				ТекСтрока.СчетНовый = СтрРезультат.СчетНовый;
			ИначеЕсли ТекСтрока.СчетНовый <> ПустойСчет Тогда
				СписокНовыхСчетов = ПолучитьНовыйСчет(Правила, ТекСтрока);
				Если СписокНовыхСчетов.Найти(ТекСтрока.СчетНовый) = Неопределено Тогда
					ТекСтрока.СчетНовый = ПустойСчет;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
